sulaolab/sonora-ak-nano/src/boot/hal_clock/nora_clock_dspic33ak_reg.c
#include "nora_clock_dspic33ak_reg.h"
#include "resident_de_boot_profile.h"

#include <xc.h>

#define DSPIC33AK_CLOCK_POLL_LIMIT (1000000UL)

/*
 * Budget for the two OBSERVATION windows in the PLL sequence, as opposed to the
 * timeout budget above.  Deliberately three orders of magnitude smaller, because
 * the two are not the same kind of wait: a timeout budget is only ever reached
 * when the hardware is broken, so it can be enormous, while an observation window
 * has "it never happened" as a VALID outcome and is therefore paid in full on
 * every single configure.  A million iterations there would be a real stall added
 * to every boot.
 */
#define DSPIC33AK_CLOCK_OBSERVE_POLLS (10000UL)

/*
 * A stalled phase is reported as the portable NORA_CLOCK_ERR_TIMEOUT plus a
 * backend diagnostic code naming the phase.  The phase itself is not a portable
 * status: "the fractional divider switch did not complete" has no meaning on a
 * part without that switch, and declaring one status value per phase produced ten
 * values of which seven were never returned.
 */
#define DSPIC33AK_CLOCK_WAIT_CLEAR(EXPR, DIAG)            \
    do {                                                  \
        uint32_t poll_count = DSPIC33AK_CLOCK_POLL_LIMIT; \
        while ((EXPR) != 0u) {                            \
            if (--poll_count == 0u) {                     \
                dspic33ak_clock_diag_set(DIAG);           \
                return NORA_CLOCK_ERR_TIMEOUT;            \
            }                                             \
        }                                                 \
    } while (0)

#define DSPIC33AK_CLOCK_WAIT_SET(EXPR, DIAG)              \
    do {                                                  \
        uint32_t poll_count = DSPIC33AK_CLOCK_POLL_LIMIT; \
        while ((EXPR) == 0u) {                            \
            if (--poll_count == 0u) {                     \
                dspic33ak_clock_diag_set(DIAG);           \
                return NORA_CLOCK_ERR_TIMEOUT;            \
            }                                             \
        }                                                 \
    } while (0)

/*
 * The general CLKGEN sequence: disable the generator, point it at the new source,
 * re-enable, then commit divider and source.
 *
 * Clearing ON first is correct for a generator that feeds a peripheral, and wrong
 * for CLKGEN1, which feeds the CPU.  CLKGEN1 goes through
 * dspic33ak_clock_reg_system_switch() instead.
 */
#define DSPIC33AK_CLOCK_CONFIGURE_CLKGEN(CONBITS, DIVBITS, CONFIG) \
    do {                                                           \
        (CONBITS).ON = 0;                                          \
        (CONBITS).NOSC = (CONFIG)->source;                         \
        (CONBITS).ON = 1;                                          \
        (CONBITS).OE = 1;                                          \
        (DIVBITS).INTDIV = (CONFIG)->intdiv;                       \
        (DIVBITS).FRACDIV = (CONFIG)->fracdiv;                     \
        (CONBITS).DIVSWEN = 1;                                     \
        DSPIC33AK_CLOCK_WAIT_CLEAR((CONBITS).DIVSWEN,              \
            NORA_CLOCK_DSPIC33AK_DIAG_DIV_SWITCH_TIMEOUT);         \
        (CONBITS).OSWEN = 1;                                       \
        DSPIC33AK_CLOCK_WAIT_CLEAR((CONBITS).OSWEN,                \
            NORA_CLOCK_DSPIC33AK_DIAG_SOURCE_SWITCH_TIMEOUT);      \
        DSPIC33AK_CLOCK_WAIT_SET((CONBITS).CLKRDY,                 \
            NORA_CLOCK_DSPIC33AK_DIAG_CLKRDY_TIMEOUT);             \
    } while (0)

/* --------------------------------------------------------------------------
 * Local helper prototypes
 * -------------------------------------------------------------------------- */

/* -------------------------------------------------------------------------- */
/* One PLL, described                                                         */
/* -------------------------------------------------------------------------- */
/*
 * PLL1 and PLL2 are the same hardware block instantiated twice, so the safe
 * programming sequence is written once, below, and the per-instance parts are
 * data: one table of operations per PLL.
 *
 * Every operation names its OWN DFP type -- pll1_* touch PLL1CONbits/PLL1DIVbits
 * and pll2_* touch PLL2CONbits/PLL2DIVbits -- so nothing here assumes the two
 * layouts agree. An earlier revision reached PLL2 through PLL1's type with a cast
 * guarded by a sizeof check; that guard was wrong, because equal size does not
 * imply equal field placement, and the whole class of mistake is gone once each
 * instance's fields are named directly.
 *
 * The instances differ in exactly this much:
 *   - which PLLxCON / PLLxDIV the operations touch
 *   - which bit of OSCCTRL reports lock (PLL1RDY b14 / PLL2RDY b15)
 * There is no per-PLL fail or status bit; CLKFAIL is device wide and is captured
 * undecoded. Nothing else differs: not the field set, not the input sources, not
 * the frequency limits. A future real difference belongs in this table, and there
 * is none today -- which is why there is no quirk field to fill in wrongly.
 *
 * The operations are functions and not pointers-to-registers for a second reason
 * as well: the host model of the register file has to observe every access to
 * advance the commit sequencer the wait loops below are written against (see
 * src/tests/hal_clock/fake_xc/nora_fake_clock.h), and an SFR name there expands to
 * a call. On the device each of these is a handful of instructions on a sequence
 * that runs a few times at boot.
 */
typedef enum {
    DSPIC33AK_PLL_COMMIT_DIVSWEN = 0,
    DSPIC33AK_PLL_COMMIT_PLLSWEN,
    DSPIC33AK_PLL_COMMIT_FOUTSWEN,
    DSPIC33AK_PLL_COMMIT_OSWEN
} dspic33ak_pll_commit_t;

typedef struct {
    void     (*enable)(bool on);
    bool     (*enabled)(void);
    /* Writes the four divider fields only; leaves `source` alone. */
    void     (*write_dividers)(const dspic33ak_clock_reg_pll_config_t *config);
    void     (*read_dividers)(dspic33ak_clock_reg_pll_config_t *out);
    void     (*select)(uint16_t nosc);
    uint16_t (*current)(void);      /* COSC -- selected now */
    void     (*commit)(dspic33ak_pll_commit_t which);
    bool     (*pending)(dspic33ak_pll_commit_t which);
    bool     (*clkrdy)(void);       /* PLLxCON.CLKRDY */
    bool     (*locked)(void);       /* OSCCTRL.PLLxRDY */
} dspic33ak_pll_ops_t;

static void pll1_enable(bool on)
{
    PLL1CONbits.ON = on ? 1u : 0u;
}

static bool pll1_enabled(void)
{
    return PLL1CONbits.ON != 0u;
}

