sulaolab/sonora-ak-nano/src/boot/hal_clock/nora_clock_dspic33ak_reg.c
static void pll1_write_dividers(const dspic33ak_clock_reg_pll_config_t *config)
{
    PLL1DIVbits.PLLFBDIV = config->feedback_div;
    PLL1DIVbits.PLLPRE = config->pre_div;
    PLL1DIVbits.POSTDIV1 = config->post_div1;
    PLL1DIVbits.POSTDIV2 = config->post_div2;
}

static void pll1_read_dividers(dspic33ak_clock_reg_pll_config_t *out)
{
    out->feedback_div = (uint32_t)PLL1DIVbits.PLLFBDIV;
    out->pre_div = (uint16_t)PLL1DIVbits.PLLPRE;
    out->post_div1 = (uint16_t)PLL1DIVbits.POSTDIV1;
    out->post_div2 = (uint16_t)PLL1DIVbits.POSTDIV2;
}

static void pll1_select(uint16_t nosc)
{
    PLL1CONbits.NOSC = (uint8_t)nosc;
}

static uint16_t pll1_current(void)
{
    return (uint16_t)PLL1CONbits.COSC;
}

static void pll1_commit(dspic33ak_pll_commit_t which)
{
    switch (which) {
    case DSPIC33AK_PLL_COMMIT_DIVSWEN:
        PLL1CONbits.DIVSWEN = 1u;
        break;
    case DSPIC33AK_PLL_COMMIT_PLLSWEN:
        PLL1CONbits.PLLSWEN = 1u;
        break;
    case DSPIC33AK_PLL_COMMIT_FOUTSWEN:
        PLL1CONbits.FOUTSWEN = 1u;
        break;
    default:
        PLL1CONbits.OSWEN = 1u;
        break;
    }
}

static bool pll1_pending(dspic33ak_pll_commit_t which)
{
    switch (which) {
    case DSPIC33AK_PLL_COMMIT_DIVSWEN:
        return PLL1CONbits.DIVSWEN != 0u;
    case DSPIC33AK_PLL_COMMIT_PLLSWEN:
        return PLL1CONbits.PLLSWEN != 0u;
    case DSPIC33AK_PLL_COMMIT_FOUTSWEN:
        return PLL1CONbits.FOUTSWEN != 0u;
    default:
        return PLL1CONbits.OSWEN != 0u;
    }
}

static bool pll1_clkrdy(void)
{
    return PLL1CONbits.CLKRDY != 0u;
}

static bool pll1_locked(void)
{
    return OSCCTRLbits.PLL1RDY != 0u;
}

static void pll2_enable(bool on)
{
    PLL2CONbits.ON = on ? 1u : 0u;
}

static bool pll2_enabled(void)
{
    return PLL2CONbits.ON != 0u;
}

static void pll2_write_dividers(const dspic33ak_clock_reg_pll_config_t *config)
{
    PLL2DIVbits.PLLFBDIV = config->feedback_div;
    PLL2DIVbits.PLLPRE = config->pre_div;
    PLL2DIVbits.POSTDIV1 = config->post_div1;
    PLL2DIVbits.POSTDIV2 = config->post_div2;
}

static void pll2_read_dividers(dspic33ak_clock_reg_pll_config_t *out)
{
    out->feedback_div = (uint32_t)PLL2DIVbits.PLLFBDIV;
    out->pre_div = (uint16_t)PLL2DIVbits.PLLPRE;
    out->post_div1 = (uint16_t)PLL2DIVbits.POSTDIV1;
    out->post_div2 = (uint16_t)PLL2DIVbits.POSTDIV2;
}

static void pll2_select(uint16_t nosc)
{
    PLL2CONbits.NOSC = (uint8_t)nosc;
}

static uint16_t pll2_current(void)
{
    return (uint16_t)PLL2CONbits.COSC;
}

static void pll2_commit(dspic33ak_pll_commit_t which)
{
    switch (which) {
    case DSPIC33AK_PLL_COMMIT_DIVSWEN:
        PLL2CONbits.DIVSWEN = 1u;
        break;
    case DSPIC33AK_PLL_COMMIT_PLLSWEN:
        PLL2CONbits.PLLSWEN = 1u;
        break;
    case DSPIC33AK_PLL_COMMIT_FOUTSWEN:
        PLL2CONbits.FOUTSWEN = 1u;
        break;
    default:
        PLL2CONbits.OSWEN = 1u;
        break;
    }
}

static bool pll2_pending(dspic33ak_pll_commit_t which)
{
    switch (which) {
    case DSPIC33AK_PLL_COMMIT_DIVSWEN:
        return PLL2CONbits.DIVSWEN != 0u;
    case DSPIC33AK_PLL_COMMIT_PLLSWEN:
        return PLL2CONbits.PLLSWEN != 0u;
    case DSPIC33AK_PLL_COMMIT_FOUTSWEN:
        return PLL2CONbits.FOUTSWEN != 0u;
    default:
        return PLL2CONbits.OSWEN != 0u;
    }
}

static bool pll2_clkrdy(void)
{
    return PLL2CONbits.CLKRDY != 0u;
}

static bool pll2_locked(void)
{
    return OSCCTRLbits.PLL2RDY != 0u;
}

static const dspic33ak_pll_ops_t s_pll1_ops = {
    pll1_enable, pll1_enabled, pll1_write_dividers, pll1_read_dividers,
    pll1_select, pll1_current, pll1_commit, pll1_pending, pll1_clkrdy,
    pll1_locked
};

static const dspic33ak_pll_ops_t s_pll2_ops = {
    pll2_enable, pll2_enabled, pll2_write_dividers, pll2_read_dividers,
    pll2_select, pll2_current, pll2_commit, pll2_pending, pll2_clkrdy,
    pll2_locked
};

/*
 * The single place a PLL number turns into registers, so a caller that reads a
 * PLL and a caller that programs one cannot disagree about which registers that
 * PLL is.  Null for an instance this part does not have.
 */
static const dspic33ak_pll_ops_t *dspic33ak_pll_ops(nora_clock_pll_t pll)
{
    switch (pll) {
    case NORA_CLOCK_PLL_1:
        return &s_pll1_ops;
    case NORA_CLOCK_PLL_2:
        return &s_pll2_ops;
    default:
        return 0;
    }
}

static nora_clock_status_t dspic33ak_pll_program(
    const dspic33ak_pll_ops_t *ops,
    const dspic33ak_clock_reg_pll_config_t *config);

/* -------------------------------------------------------------------------- */
/* Configure PLL register block                                               */
/* -------------------------------------------------------------------------- */
nora_clock_status_t dspic33ak_clock_reg_pll_configure(
    nora_clock_pll_t pll,
    const dspic33ak_clock_reg_pll_config_t *config)
{
    if (config == 0) {
        return NORA_CLOCK_ERR_INVALID_ARG;
    }

    {
        const dspic33ak_pll_ops_t *ops = dspic33ak_pll_ops(pll);

        if (ops == 0) {
            return NORA_CLOCK_ERR_INVALID_ARG;
        }
        return dspic33ak_pll_program(ops, config);
    }
}

/* -------------------------------------------------------------------------- */
/* Configure CLKGEN register block                                            */
/* -------------------------------------------------------------------------- */
nora_clock_status_t dspic33ak_clock_reg_clkgen_configure(
    nora_clock_dspic33ak_clkgen_t clkgen,
    const dspic33ak_clock_reg_clkgen_config_t *config)
{
    if (config == 0) {
        return NORA_CLOCK_ERR_INVALID_ARG;
    }

    switch (clkgen) {
#if SONORA_RESIDENT_BOOTLOADER_AK128
    /* CLKGEN1 is changed through the live-system switch path. The resident
     * only owns peripheral CLKGEN6 (Timer1) and CLKGEN8 (UART1). */
    case NORA_CLOCK_DSPIC33AK_CLKGEN_6:
        DSPIC33AK_CLOCK_CONFIGURE_CLKGEN(CLK6CONbits, CLK6DIVbits, config);
        return NORA_CLOCK_OK;
    case NORA_CLOCK_DSPIC33AK_CLKGEN_8:
        DSPIC33AK_CLOCK_CONFIGURE_CLKGEN(CLK8CONbits, CLK8DIVbits, config);
        return NORA_CLOCK_OK;
#else
    case NORA_CLOCK_DSPIC33AK_CLKGEN_1:
        /* Not the general sequence: this generator is clocking the caller. */
        return dspic33ak_clock_reg_system_switch(config);
    case NORA_CLOCK_DSPIC33AK_CLKGEN_5:
        DSPIC33AK_CLOCK_CONFIGURE_CLKGEN(CLK5CONbits, CLK5DIVbits, config);
        return NORA_CLOCK_OK;
    case NORA_CLOCK_DSPIC33AK_CLKGEN_6:
        DSPIC33AK_CLOCK_CONFIGURE_CLKGEN(CLK6CONbits, CLK6DIVbits, config);
        return NORA_CLOCK_OK;
    case NORA_CLOCK_DSPIC33AK_CLKGEN_8:
        DSPIC33AK_CLOCK_CONFIGURE_CLKGEN(CLK8CONbits, CLK8DIVbits, config);
        return NORA_CLOCK_OK;
    case NORA_CLOCK_DSPIC33AK_CLKGEN_9:
        DSPIC33AK_CLOCK_CONFIGURE_CLKGEN(CLK9CONbits, CLK9DIVbits, config);
        return NORA_CLOCK_OK;
    case NORA_CLOCK_DSPIC33AK_CLKGEN_10:
        DSPIC33AK_CLOCK_CONFIGURE_CLKGEN(CLK10CONbits, CLK10DIVbits, config);
        return NORA_CLOCK_OK;
    case NORA_CLOCK_DSPIC33AK_CLKGEN_12:
        DSPIC33AK_CLOCK_CONFIGURE_CLKGEN(CLK12CONbits, CLK12DIVbits, config);
        return NORA_CLOCK_OK;
    case NORA_CLOCK_DSPIC33AK_CLKGEN_13:
        DSPIC33AK_CLOCK_CONFIGURE_CLKGEN(CLK13CONbits, CLK13DIVbits, config);
        return NORA_CLOCK_OK;
#endif
    default:
        return NORA_CLOCK_ERR_INVALID_ARG;
    }
}

