sulaolab/sonora-ak-nano/src/boot/hal_clock/nora_clock_dspic33ak_reg.c
/* -------------------------------------------------------------------------- */
/* Re-source the system clock generator (CLKGEN1)                             */
/* -------------------------------------------------------------------------- */
nora_clock_status_t dspic33ak_clock_reg_system_switch(
    const dspic33ak_clock_reg_clkgen_config_t *config)
{
    nora_clock_status_t status;

    if (config == 0) {
        return NORA_CLOCK_ERR_INVALID_ARG;
    }

    /*
     * Divider first, then source -- the order this function has always used and
     * the one that is hardware-verified.  It is also why the two halves are
     * separate entry points now: this order applies the new divider to the OLD
     * source, which is safe when the new source is no faster (every case in this
     * project) and wrong for a caller that raises the source frequency while
     * lowering the divider.  Such a caller steps through the two primitives in
     * the order its transition needs rather than have this sequence guess.
     */
    status = dspic33ak_clock_reg_system_set_divider(config->intdiv,
        config->fracdiv);
    if (status != NORA_CLOCK_OK) {
        return status;
    }

    return dspic33ak_clock_reg_system_switch_source(config->source);
}

/* -------------------------------------------------------------------------- */
/* Re-source the system clock generator, leaving its divider alone            */
/* -------------------------------------------------------------------------- */
/*
 * ON is never cleared here.  CLKGEN1's output is the system clock, so it is
 * clocking the CPU that is executing this function: DS70005591C 13.4.2 re-sources a
 * live generator by committing the source (OSWEN) with the generator left enabled
 * throughout.
 *
 * The general CLKGEN sequence drops ON first, which is right for a generator
 * nothing is executing from and fatal for this one.  That is measured, not
 * inferred: a live CLKGEN1 re-source through the general macro was verified to hang
 * the CPU (the Q27C note in src/board/clock/sonora_clock.c), and the resident
 * engine's boot platform hand-rolled exactly this order rather than call this HAL,
 * for the same reason.
 *
 * CLK1DIV is not written at all.  A source switch that also re-divided the CPU
 * clock was the hidden half of nora_clock_switch_source(); the divider is now only
 * ever changed by a caller that asked for it.
 */
nora_clock_status_t dspic33ak_clock_reg_system_switch_source(uint16_t source)
{
    /* Not named poll_count: DSPIC33AK_CLOCK_WAIT_CLEAR declares one of its own in
     * its block, and a same-named local here would shadow it (MSVC C4456; XC-DSC
     * is silent about it).  The two counters are independent waits either way. */
    uint32_t ready_polls;

    CLK1CONbits.ON = 1;
    CLK1CONbits.OE = 1;

    CLK1CONbits.NOSC = source;
    CLK1CONbits.OSWEN = 1;
    DSPIC33AK_CLOCK_WAIT_CLEAR(CLK1CONbits.OSWEN,
        NORA_CLOCK_DSPIC33AK_DIAG_SOURCE_SWITCH_TIMEOUT);

    /*
     * Completed *and* took effect.  OSWEN clearing says the sequencer finished; it
     * does not by itself say the requested source is the one now selected, and
     * returning OK on a switch that did not take would leave every frequency
     * derived from this clock silently wrong.  Both conditions are polled together
     * so the failure is one status rather than a race between two waits.
     */
    ready_polls = DSPIC33AK_CLOCK_POLL_LIMIT;
    while ((CLK1CONbits.CLKRDY == 0u) ||
           ((uint16_t)CLK1CONbits.COSC != source)) {
        if (--ready_polls == 0u) {
            dspic33ak_clock_diag_set(NORA_CLOCK_DSPIC33AK_DIAG_CLKRDY_TIMEOUT);
            return NORA_CLOCK_ERR_TIMEOUT;
        }
    }

    return NORA_CLOCK_OK;
}

/* -------------------------------------------------------------------------- */
/* Re-divide the system clock generator, leaving its source alone             */
/* -------------------------------------------------------------------------- */
/*
 * The other half.  Same reason ON stays set, and the same DIVSWEN commit the
 * combined sequence always performed -- extracted rather than reimplemented, so
 * there is one copy of the live-generator rules.
 */
nora_clock_status_t dspic33ak_clock_reg_system_set_divider(
    uint16_t intdiv,
    uint16_t fracdiv)
{
    CLK1CONbits.ON = 1;
    CLK1CONbits.OE = 1;

    CLK1DIVbits.INTDIV = intdiv;
    CLK1DIVbits.FRACDIV = fracdiv;
    CLK1CONbits.DIVSWEN = 1;
    DSPIC33AK_CLOCK_WAIT_CLEAR(CLK1CONbits.DIVSWEN,
        NORA_CLOCK_DSPIC33AK_DIAG_DIV_SWITCH_TIMEOUT);

    return NORA_CLOCK_OK;
}

/* -------------------------------------------------------------------------- */
/* Read the system clock state                                                */
/* -------------------------------------------------------------------------- */
void dspic33ak_clock_reg_read_system(dspic33ak_clock_reg_system_t *out)
{
    if (out == 0) {
        return;
    }

    out->source = (uint16_t)CLK1CONbits.COSC;
    out->intdiv = (uint16_t)CLK1DIVbits.INTDIV;
    out->fracdiv = (uint16_t)CLK1DIVbits.FRACDIV;
    out->ready = (CLK1CONbits.CLKRDY != 0u);
    out->pll1_ready = (OSCCTRLbits.PLL1RDY != 0u);
    out->pll2_ready = (OSCCTRLbits.PLL2RDY != 0u);
}

/* -------------------------------------------------------------------------- */
/* Read one PLL's configuration                                               */
/* -------------------------------------------------------------------------- */
void dspic33ak_clock_reg_read_pll(
    nora_clock_pll_t pll,
    dspic33ak_clock_reg_pll_state_t *out)
{
    if (out == 0) {
        return;
    }

    out->source = 0u;
    out->feedback_div = 0u;
    out->pre_div = 0u;
    out->post_div1 = 0u;
    out->post_div2 = 0u;
    out->enabled = false;
    out->ready = false;

    {
        const dspic33ak_pll_ops_t *ops = dspic33ak_pll_ops(pll);
        dspic33ak_clock_reg_pll_config_t dividers;

        /* Same table the programming path uses, so a caller that reads a PLL and
         * a caller that programs one cannot disagree about which registers that
         * PLL is.  An instance this part does not have keeps the zeros set above,
         * so a record that could not be taken does not look taken. */
        if (ops == 0) {
            return;
        }

        ops->read_dividers(&dividers);

