sulaolab/sonora-ak-nano/src/boot/hal_clock/nora_clock_dspic33ak_reg.c
        /*
         * COSC, the source now selected -- NOT NOSC, the one last requested.
         * They differ exactly when a switch did not take, and in that case NOSC
         * would have this report the frequency the caller ASKED for while the PLL
         * is still running the old source.  The whole reason this record is read
         * back from registers instead of remembered is so a sequence that failed
         * part way through cannot leave a wish standing as the truth, and NOSC is
         * a wish.
         */
        out->source = ops->current();
        out->feedback_div = dividers.feedback_div;
        out->pre_div = dividers.pre_div;
        out->post_div1 = dividers.post_div1;
        out->post_div2 = dividers.post_div2;
        out->enabled = ops->enabled();
        out->ready = ops->locked();
    }
}

/* -------------------------------------------------------------------------- */
/* Register capture (public AK API; defined here because it is all SFR reads)  */
/* -------------------------------------------------------------------------- */
void nora_clock_dspic33ak_raw_capture(nora_clock_dspic33ak_raw_t *out)
{
    if (out == 0) {
        return;
    }

    out->oscctrl = (uint32_t)OSCCTRL;
    out->clkfail = (uint32_t)CLKFAIL;
    out->pll1con = (uint32_t)PLL1CON;
    out->pll1div = (uint32_t)PLL1DIV;
    out->pll2con = (uint32_t)PLL2CON;
    out->pll2div = (uint32_t)PLL2DIV;
}

void nora_clock_dspic33ak_clkgen_raw_capture(
    nora_clock_dspic33ak_clkgen_t clkgen,
    nora_clock_dspic33ak_clkgen_raw_t *out)
{
    if (out == 0) {
        return;
    }

    /* An unknown generator reports zeros rather than a stale or invented value:
     * this is a record, and a record that could not be taken must not look
     * taken. */
    out->con = 0u;
    out->div = 0u;

    switch (clkgen) {
    case NORA_CLOCK_DSPIC33AK_CLKGEN_1:
        out->con = (uint32_t)CLK1CON;
        out->div = (uint32_t)CLK1DIV;
        break;
    case NORA_CLOCK_DSPIC33AK_CLKGEN_5:
        out->con = (uint32_t)CLK5CON;
        out->div = (uint32_t)CLK5DIV;
        break;
    case NORA_CLOCK_DSPIC33AK_CLKGEN_6:
        out->con = (uint32_t)CLK6CON;
        out->div = (uint32_t)CLK6DIV;
        break;
    case NORA_CLOCK_DSPIC33AK_CLKGEN_8:
        out->con = (uint32_t)CLK8CON;
        out->div = (uint32_t)CLK8DIV;
        break;
    case NORA_CLOCK_DSPIC33AK_CLKGEN_9:
        out->con = (uint32_t)CLK9CON;
        out->div = (uint32_t)CLK9DIV;
        break;
    case NORA_CLOCK_DSPIC33AK_CLKGEN_10:
        out->con = (uint32_t)CLK10CON;
        out->div = (uint32_t)CLK10DIV;
        break;
    case NORA_CLOCK_DSPIC33AK_CLKGEN_12:
        out->con = (uint32_t)CLK12CON;
        out->div = (uint32_t)CLK12DIV;
        break;
    case NORA_CLOCK_DSPIC33AK_CLKGEN_13:
        out->con = (uint32_t)CLK13CON;
        out->div = (uint32_t)CLK13DIV;
        break;
    default:
        break;
    }
}

/* -------------------------------------------------------------------------- */
/* Program one PLL -- the whole safe sequence, once                           */
/* -------------------------------------------------------------------------- */
/*
 * Order and every wait in it are the same for both instances.  This replaced two
 * functions that had drifted apart: PLL1's had been corrected after the rev A1
 * measurements and PLL2's still followed DS70005591D Example 12-4, which the data
 * sheet's own section 12.4.6.1 contradicts.  Both orders were measured working on
 * this silicon (3/3 true cold PORs, and 4/4 cold POR on the unified sequence),
 * so this is not a bug fix dressed as a refactor -- it is one sequence instead
 * of two, and the one kept is the one the data sheet's normative text asks for.
 */

/*
 * Is the PLL still running?  Asked of the two lock indications rather than of ON,
 * because ON is a REQUEST: DS70005591D 12.4.1 has the hardware OR it with every
 * consumer's clock request, so the bit can read back exactly as written while the
 * block keeps going.  A PLL that has actually stopped is not locked and does not
 * report CLKRDY, and the host model ties both to ON for the same reason.
 */
static bool pll_is_running(const dspic33ak_pll_ops_t *ops)
{
    return ops->locked() || ops->clkrdy();
}

/* Is it already set up exactly as asked -- all four dividers and the source that
 * is CURRENT, not the one last requested? */
static bool pll_already_configured(const dspic33ak_pll_ops_t *ops,
                                   const dspic33ak_clock_reg_pll_config_t *config)
{
    dspic33ak_clock_reg_pll_config_t now;

    ops->read_dividers(&now);

    return (now.feedback_div == config->feedback_div) &&
           (now.pre_div == config->pre_div) &&
           (now.post_div1 == config->post_div1) &&
           (now.post_div2 == config->post_div2) &&
           (ops->current() == config->source);
}

static nora_clock_status_t dspic33ak_pll_program(
    const dspic33ak_pll_ops_t *ops,
    const dspic33ak_clock_reg_pll_config_t *config)
{
    /* Not named poll_count: DSPIC33AK_CLOCK_WAIT_CLEAR declares one of its own
     * in its block and a same-named local here would shadow it. */
    uint32_t observe;
    uint32_t ready_polls;

    /*
     * Already locked on exactly these settings: nothing to do, and NOTHING IS
     * WRITTEN.  This is the idempotent case and it matters because
     * sonora_clock_pll2_from_refi1() is reached from four separate board entry
     * points that each secure PLL2, so an application using more than one of them
     * asks for the same operating point twice in a boot.  Answering that by
     * taking the PLL out of lock and putting it back would be a glitch on a clock
     * something is already using, for no change.
     */
    if (ops->locked() && ops->clkrdy() && pll_already_configured(ops, config)) {
        /*
         * One thing may still be missing: the PLL can be locked on exactly these
         * settings with ON CLEAR, because a consumer's clock request is the only
         * thing holding it up (DS70005591D 12.4.1 ORs the two).  Take our own hold
         * as well, or the PLL stops the moment that consumer releases it and the
         * caller is left believing it owns a clock that has gone.  Nothing else is
         * touched: no divider, no source, no switch request.
         *
         * With ON already set this writes nothing at all, which is the ordinary
         * repeat-call case.
         */
        if (!ops->enabled()) {
            ops->enable(true);
        }
        return NORA_CLOCK_OK;
    }

