sulaolab/sonora-ak-nano/src/boot/hal_clock/nora_clock_dspic33ak_reg.c
    /*
     * Something has to change, so the generator has to stop first: POSTDIV1 and
     * POSTDIV2 must not be changed while the PLL is operating (DS70005591D
     * 12.4.6.1 step 3b) and Note 1 of the same section recommends settling every
     * divider before the first clock switch.  Example 12-4 does neither.
     */
    ops->enable(false);

    observe = DSPIC33AK_CLOCK_OBSERVE_POLLS;
    while (pll_is_running(ops) && (--observe != 0u)) {
    }

    /*
     * It did not stop, so a consumer is still requesting it (12.4.1 again) and it
     * is NOT ours to reprogram.  Refuse with every divider untouched: writing them
     * to a running PLL is the violation this sequence exists to avoid, and doing it
     * anyway would corrupt the clock of whatever is holding it.  Our stop request
     * is taken back first, or it would take effect later when that consumer
     * released the PLL and stop a clock nobody asked to stop.
     *
     * The wanted operating point being the one it is already on is handled above
     * and never reaches here, so a caller re-asking for what it has cannot be
     * refused by this.
     */
    if (pll_is_running(ops)) {
        ops->enable(true);
        dspic33ak_clock_diag_set(NORA_CLOCK_DSPIC33AK_DIAG_PLL_STOP_REFUSED);
        return NORA_CLOCK_ERR_TIMEOUT;
    }

    ops->write_dividers(config);

    ops->enable(true);
    /* No OE write here, and do not add one back: PLLxCON HAS NO OE BIT.
     * Data sheet DS70005591 (rev C and rev D alike) leaves PLLxCON bit 12
     * unnamed, with no bit description; only CLKxCON bit 12 is OE, and it
     * means "clock output is enabled to be an output on a device pin" -- a
     * PLL output never reaches a pin. The DFP declared it anyway up to
     * MC 1.4.172 / MP 1.3.185, copied from the CLKGEN CON template, and
     * MC 1.5.263 / MP 1.4.260 removed it. The write was also measured
     * non-causal for the warm-entry PLL hang (v71-v72), so nothing here
     * depended on it. See recorded validation.
     * It was already re-added once by a merge; that is why this note is long. */

    /*
     * Rev A1 quirk, and a block-level one rather than a per-instance one: writing
     * ON starts a DIVSWEN transfer that software never requested.  Let it become
     * visible, then let it finish, so PLLSWEN is not issued behind a transfer
     * already in flight.  A cold path may not assert it at all, so absence within
     * the observation window is equally valid -- which is exactly why the window
     * is DSPIC33AK_CLOCK_OBSERVE_POLLS and not the timeout budget.
     *
     * Measured on both instances: PLL1 during the original A1 investigation, PLL2
     * on 2026-09-13 (`step DIVSWEN ... us=59 OK` in the cold-POR records of the
     * closure doc). The host model asserts it for both slots too.
     */
    observe = DSPIC33AK_CLOCK_OBSERVE_POLLS;
    while (!ops->pending(DSPIC33AK_PLL_COMMIT_DIVSWEN) && (--observe != 0u)) {
    }
    if (ops->pending(DSPIC33AK_PLL_COMMIT_DIVSWEN)) {
        DSPIC33AK_CLOCK_WAIT_CLEAR(ops->pending(DSPIC33AK_PLL_COMMIT_DIVSWEN),
            NORA_CLOCK_DSPIC33AK_DIAG_DIV_SWITCH_TIMEOUT);
    }

    ops->commit(DSPIC33AK_PLL_COMMIT_PLLSWEN);
    DSPIC33AK_CLOCK_WAIT_CLEAR(ops->pending(DSPIC33AK_PLL_COMMIT_PLLSWEN),
        NORA_CLOCK_DSPIC33AK_DIAG_PLL_SWITCH_TIMEOUT);

    ops->commit(DSPIC33AK_PLL_COMMIT_FOUTSWEN);
    DSPIC33AK_CLOCK_WAIT_CLEAR(ops->pending(DSPIC33AK_PLL_COMMIT_FOUTSWEN),
        NORA_CLOCK_DSPIC33AK_DIAG_FOUT_SWITCH_TIMEOUT);

    ops->select(config->source);
    ops->commit(DSPIC33AK_PLL_COMMIT_OSWEN);
    DSPIC33AK_CLOCK_WAIT_CLEAR(ops->pending(DSPIC33AK_PLL_COMMIT_OSWEN),
        NORA_CLOCK_DSPIC33AK_DIAG_SOURCE_SWITCH_TIMEOUT);

    /*
     * Locked, and locked on the source that was asked for.  Three conditions,
     * each ruling out a different lie, polled together so a failure is one status
     * instead of a race between separate waits -- the same shape
     * dspic33ak_clock_reg_system_switch_source() uses for CLKGEN1:
     *
     *   - OSCCTRL's lock bit: the analog loop has settled
     *   - PLLxCON.CLKRDY:     the PLL block itself agrees it is ready
     *   - COSC == source:     the switch selected what was requested, not what
     *                         was already selected
     *
     * All three are per request and self clearing, so none of them can be
     * satisfied by a lock left standing from a previous configure at different
     * dividers.  The old configure_pll2() waited only for OSCCTRL's bit; on a
     * second call that bit was already 1, so it returned OK without proving a
     * single thing about the new dividers.  PLL1 escaped that only as a side
     * effect of clearing ON.
     */
    ready_polls = DSPIC33AK_CLOCK_POLL_LIMIT;
    while ((!ops->locked()) ||
           (!ops->clkrdy()) ||
           (ops->current() != config->source)) {
        if (--ready_polls == 0u) {
            dspic33ak_clock_diag_set(NORA_CLOCK_DSPIC33AK_DIAG_PLL_LOCK_TIMEOUT);
            return NORA_CLOCK_ERR_TIMEOUT;
        }
    }

    return NORA_CLOCK_OK;
}
